Repository: MrMDrX/WaStash
Catalog: lib/l10n/app_*.arb
Languages: ar

# thisLanguage
source: English 🇺🇸
ar: اللغة العربية 🇸🇦

# appSlogan
source: Minimal WhatsApp Status Viewer & Saver App for Android
ar: تطبيق بسيط لعرض و حفظ حالات الواتساب للاندرويد

source: Language
ar: اللغة

source: Arabic 🇸🇦
ar: العربية 🇸🇦

source: English 🇺🇸
ar: الإنجليزية 🇺🇸

source: French 🇫🇷
ar: الفرنسية 🇫🇷

source: Spanish 🇪🇸
ar: الإسبانية 🇪🇸

source: Russian 🇷🇺
ar: الروسية 🇷🇺

source: Chinese 🇨🇳
ar: الصينية 🇨🇳

source: Portuguese 🇵🇹
ar: البرتغالية 🇵🇹

source: Theme
ar: السمة

source: Dark
ar: داكن

source: Light
ar: فاتح

source: System
ar: مظهر الجهاز

# welcome
source: Welcome to WaStash!
ar: مرحبا بك في WaStash!

# continueOnboarding
source: Continue
ar: متابعة

source: Status Saver
ar: حافظ الحالات

source: Status Viewer
ar: مشاهدة الحالات

# statusSaverDescription
source: Easily save and share any status you've viewed. Never miss out on important moments.
ar: احفظ وشارك أي حالة شاهدتها بكل سهولة لا تفوّت اللحظات المهمة.

# statusViewerDescription
source: Quickly view all your friend's statuses in one place. Stay updated with every moment they share.
ar: عرض جميع حالات أصدقائك بسرعة في مكان واحد. ابقَ على اطلاع بكل لحظة يشاركونها.

# statusSaverSubtitle
source: Easily save any WhatsApp Status to your local storage
ar: احفظ أي حالة من حالات واتساب بسهولة على ذاكرة التخزين المحلية لديك

source: Beautiful Design
ar: تصميم جميل

# beautifulDesignDescription
source: A thoughtfully designed and optimized UI that makes navigating through the app a delightful experience.
ar: واجهة مستخدم مصممة بعناية ومحسّنة تجعل التنقل عبر التطبيق تجربة ممتعة.

# storageAccessIsRequired
source: Storage access is required for Status files
ar: الوصول للذاكرة المحلية ضروري للحالات

source: Select Status Folder
ar: حدد مجلد الحالات

source: Images
ar: صور

source: Videos
ar: فيديوهات

source: Status
ar: حالات

# noStatus
source: No statuses found
ar: لا توجد حالات

source: Saved Status
ar: الحالات المحفوظة

# savedStatusSubtitle
source: View and manage your saved statuses in one place
ar: قم بعرض وإدارة حالاتك المحفوظة من مكان واحد.

# noSavedStatus
source: No saved statuses found
ar: لا توجد حالات محفوظة

source: Delete
ar: حذف

source: Delete Status
ar: حذف الحالة

# deleteStatusMessage
source: Are you sure you want to delete this file?
ar: هل أنت متأكد أنك تريد حذف هذا الملف؟

source: Saved to
ar: تم الحفظ في

# errorSaving
source: Error saving file
ar: حدث خطأ أثناء حفظ الملف

# fileDeleted
source: File deleted successfully!
ar: تم حذف الملف بنجاح!

source: Undo
ar: تراجع

source: File not found
ar: الملف غير موجود

# errorDeleting
source: Error deleting file
ar: حدث خطأ أثناء حذف الملف

# errorSharing
source: Error sharing file
ar: حدث خطأ أثناء مشاركة الملف

source: Yes
ar: نعم

source: Ok
ar: موافق

source: Important
ar: مهم جدا

# accessHowTo
source: On the next screen, make sure to select the location "Android/media/com.whatsapp/WhatsApp/Media/.Statuses". Once done, press the "Use this folder" button at the bottom to confirm. Selecting any other folder would not work.
ar: في الشاشة التالية، تأكد من تحديد المسار التالي "Android/media/com.whatsapp/WhatsApp/Media/.Statuses". بعد ذلك، انقر على الزر "Use this folder" الموجود في الأسفل للتأكيد. لن يعمل التطبيق إذا قمت بتحديد أي مجلد آخر.

source: Save
ar: حفظ

source: Share
ar: مشاركة

source: Cancel
ar: إلغاء

source: Settings
ar: الإعدادات

# settingsDescription
source: Adjust your settings or know more about the app
ar: اضبط إعداداتك أو تعرف على المزيد عن التطبيق

source: Status file location
ar: مسار الحالات

source: Donate or Support
ar: تبرع و ادعم

source: Support me on Ko-Fi
ar: ادعمني على كوفي

# githubRepo
source: Github Repository
ar: المستودع في جيتهاب

# reviewCode
source: Review the codebase
ar: ألق نظرة على مصدر التطبيق

source: View Onboarding
ar: عرض التقديم

source: Made with
ar: صُنع ب

# andFlutter
source: and Flutter by
ar: و فلاتر و
